Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_85-The_Question_of_Maitreya-v1.tmx
Source language: bo
Languages: en

source: ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་འདི་གལ་ཏེ་ཡུན་རིང་པོ་དེ་སྲིད་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་ལགས་ན།
en: Blessed One, if this bodhisattva mahāsattva Maitreya developed acceptance so long ago of the fact that all phenomena are unproduced,

source: ཅིའི་སླད་དུ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས།
en: why did he not quickly realize supreme, perfect enlightenment and become a buddha?

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Blessed One replied to the venerable Ānanda,

source: །ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བཀོད་པ་དང་ཡོངས་སུ་གཟུང་བ་ནི་གཉིས་པོ་འདི་དག་སྟེ།
en: Ānanda, the bodhisattvas set in place and protect two things.

source: གཉིས་གང་ཞེ་ན།
en: What two things?

source: སེམས་ཅན་བཀོད་པ་དང་སེམས་ཅན་ཡོངས་སུ་གཟུང་བ་དང་།
en: They set in place and protect sentient beings, and

source: ཞིང་བཀོད་པ་དང་ཞིང་ཡོངས་སུ་གཟུང་བ་དང་།
en: they set in place and protect their buddha realms.

source: གཉིས་པོ་འདི་དག་ཡིན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་ནི་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་
en: But of these two, when formerly the bodhisattva mahāsattva Maitreya was engaged in the conduct of a bodhisattva,

source: ཞིང་བཀོད་པ་རྣམ་པར་སྦྱངས་ཤིང་ཡོངས་སུ་གཟུང་བ་ཡོངས་སུ་བཟུང་ངོ་།
en: he set in place, consecrated, and protected his buddha realm.

source: །ཀུན་དགའ་བོ་ང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ།
en: Ānanda, when I myself was formerly engaged in the conduct of a bodhisattva,

source: ངས་ནི་སེམས་ཅན་བཀོད་པ་རྣམ་པར་སྦྱངས། སེམས་ཅན་ཡོངས་སུ་གཟུང་བ་ཡོངས་སུ་བཟུང་།
en: I set in place and protected sentient beings,

source: ཞིང་བཀོད་པ་ཡང་རྣམ་པར་སྦྱངས། ཞིང་ཡོངས་སུ་གཟུང་བ་ཡང་ཡོངས་སུ་བཟུང་ངོ་།
en: and I also set in place and protected my buddha realm.

source: །ཀུན་དགའ་བོ་ངས་མངོན་པར་ཤེས་ཏེ།
en: Ānanda, I knew through foresight that

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ཡང་དག་པར་ཞུགས་ནས་བསྐལ་པ་བཞི་བཅུ་རྩ་གཉིས་ལོན་པའི་འོག་ཏུ་
en: forty-two eons after the bodhisattva mahāsattva Maitreya entered the path

source: ངས་གདོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: I would first arouse the mind of supreme, perfect enlightenment.

source: ཀུན་དགའ་བོ་བསྐལ་པ་བཟང་པོ་འདི་འདས་ནས་བསྐལ་པ་དགུ་བཅུ་རྩ་བཞི་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་རིགས་པ་ལས།
en: Ānanda, with the knowledge that, ninety-four eons after that good eon had passed, I would realize supreme, perfect enlightenment,

source: ཀུན་དགའ་བོ་ངས་བརྩོན་འགྲུས་འབར་བར་བྱས་པས་
en: I applied myself, Ānanda, with burning diligence and

source: ཀུན་དགའ་བོ་ངས་བརྩོན་འགྲུས་འབར་བར་བྱས་པས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: I applied myself, Ānanda, with burning diligence and quickly realized supreme, perfect enlightenment and became a buddha.

source: བདོག་པ་ཕངས་པ་ཐམས་ཅད་ཡོངས་སུ་བཏང་བ་དང་།
en: I abandoned and let go of all doubts,

source: ཆུང་མ་ཕངས་པ་ཡོངས་སུ་བཏང་བ་དང་།
en: abandoned and let go of my spouse,

source: བུ་ཕངས་པ་ཡོངས་སུ་བཏང་བ་དང་།
en: abandoned and let go of my child,

source: མགོ་ཕངས་པ་ཡོངས་སུ་བཏང་བ་དང་།
en: abandoned and let go of my head,

source: མིག་ཕངས་པ་ཡོངས་སུ་བཏང་བ་དང་།
en: abandoned and let go of my eyes,

source: རྒྱལ་སྲིད་ཕངས་པ་ཡོངས་སུ་བཏང་བ་དང་།
en: abandoned and let go of my kingdom,

source: ལོངས་སྤྱོད་ཕངས་པ་ཡོངས་སུ་བཏང་བ་དང་།
en: abandoned and let go of my wealth,

source: ཁྲག་ཕངས་པ་ཡོངས་སུ་བཏང་བ་དང་།
en: abandoned and let go of my blood,

source: རུས་པ་དང་རྐང་ཕངས་པ་ཡོངས་སུ་བཏང་བ་དང་།
en: abandoned and let go of my bones and marrow,

source: ཡན་ལག་ཕངས་པ་
en: and abandoned my limbs.

source: ཐམས་ཅད་ཡོངས་སུ་བཏང་བས་
en: By letting go of everything

source: ང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: I quickly realized supreme, perfect enlightenment and became a buddha.

source: ཀུན་དགའ་བོ་ང་ཚུལ་ཁྲིམས་ཀྱི་ཡོན་ཏན་གྱི་ཆོས་ལ་གནས་ཏེ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Ānanda, I adhered to the teaching of the qualities of moral conduct, and so I quickly realized supreme, perfect enlightenment and became a buddha.

source: །ཀུན་དགའ་བོ་ངས་ཚོར་བ་སྡུག་བསྔལ་བ་དྲག་པ་རྩུབ་པ་ཇི་ལྟ་བུ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ། གལ་ཏེ་ཁྱོད་ཀྱིས་ཤེས་སུ་ཟིན་ན་ཀུན་དགའ་བོ་ཁྱོད་སྤོབས་པར་མི་འགྱུར་རོ།
en: Ānanda, if you were aware of how harsh and severe were the sensations of suffering by which I realized supreme and completely perfect enlightenment, perfect buddhahood, you, Ānanda, would not be so forthright.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀུན་དགའ་བོ་
en: The reason, Ānanda, is that

source: སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་ནོར་ཐམས་ཅད་སྦྱིན་པ་ཞེས་བྱ་བ་གཟུགས་བཟང་བ།
en: formerly, in times gone by, there lived a prince named Giver of All Wealth, good-looking,

source: ཁ་དོག་བཟང་པོ། །རྒྱས་པ་མཆོག་དང་ལྡན་པ།
en: endowed with a supremely good complexion, excellent figure,

source: རྒྱལ་པོའི་འབྱོར་པ་ཆེན་པོ་དང་རྒྱལ་པོའི་མཐུ་ཆེན་པོ་དང་ལྡན་པ་ཞིག་ཡོད་པ་
en: and with the great wealth and power of a king.

source: དེ་སྐྱེད་མོས་ཚལ་དུ་འགྲོ་སྟེ།
en: He was going to a pleasure grove

source: །ཀུན་དགའ་བོ་ང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་
en: Ānanda, I adhered to the perfection of wisdom, and so

source: མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: I quickly realized supreme, perfect enlightenment and became a buddha.

source: །ཀུན་དགའ་བོ་ངས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མ་བཏང་བས་
en: Ānanda, I did not abandon any sentient being in any way, and so

source: །ཀུན་དགའ་བོ་ང་ཐབས་ལ་མཁས་པ་ལ་གནས་ཏེ་
en: Ānanda, I was skillful in my means, and so

source: །ཀུན་དགའ་བོ་ང་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པས་
en: Ānanda, I treated all sentient beings equally, and so

source: ཀུན་དགའ་བོ་ངས་སྟོང་པ་ཉིད་ཀྱི་ཆོས་རྟོགས་པས་
en: Ānanda, I realized the teaching of emptiness, and so

source: ཀུན་དགའ་བོ་ངས་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཆོས་རྟོགས་པས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: Ānanda, I realized the teaching of signlessness and wishlessness, and so I quickly realized supreme, perfect enlightenment and became a buddha.

source: དེ་མི་དེ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: approached the man, and asked,

source: །ཀྱེ་མི་ཁྱོད་ཅི་སྡུག་བསྔལ་ལམ།
en: ‘You, sir, what are you suffering from?’

source: དེས་སྨྲས་པ། ལྷ་བདག་ནི་ནད་ཀྱིས་བཏབ་བོ།
en: The man said, ‘Your Highness, I have contracted an illness.

source: །གལ་ཏེ་བདག་གིས་ལྷ་ཁྱོད་ཀྱི་ལུས་ལས་ཇི་ཙམ་གྱིས་ཚིམ་པར་འགྱུར་བའི་ཁྲག་ཅིག་བཏུང་དུ་ཐོབ་པ་ལྟ་ན་
en: ‘Your Highness,’ replied the man, ‘if I were to drink just enough of the blood from your body to satisfy me,

source: བདག་གི་ནད་ཞི་བར་འགྱུར་རོ།
en: my illness would be assuaged.

source: །ཀུན་དགའ་བོ་དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་ནོར་ཐམས་ཅད་སྦྱིན་པ་དེས་མཚོན་རྣོན་པོ་བླངས་ཏེ།
en: Then, Ānanda, Prince Giver of All Wealth took a sharp knife, cut himself, and

source: རང་གིས་ལུས་ཕུག་ནས་ཁྲག་གཟགས་ཏེ་མི་དེ་ལ་བཏུང་བར་བྱིན་ནོ།
en: gave the man the blood that drained from the wound to drink.

source: །ཀུན་དགའ་བོ་རྒྱལ་བུ་གཞོན་ནུ་ནོར་ཐམས་ཅད་སྦྱིན་པས་རང་གི་ལུས་ཕུག་སྟེ་ཁྲག་ཐམས་ཅད་གཟགས་ཀྱང་
en: Ānanda, even though Prince Giver of All Wealth cut himself and all his blood drained out,

source: འགྱོད་པའི་སེམས་གཅིག་ཀྱང་མེད་དོ།
en: he never had a moment’s regret.

source: ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་ནོར་ཐམས་ཅད་སྦྱིན་པ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Because I myself was then, at that time, Prince Giver of All Wealth.

source: །ཀུན་དགའ་བོ་རྒྱ་མཚོ་ཆེན་པོ་བཞིའི་ཆུའི་ཕུང་པོ་ནི་ཚད་གཟུང་དུ་ཡོད་ཀྱི་
en: Ānanda, all the water of the four great oceans can be measured, but

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ཡོངས་སུ་ཚོལ་ཞིང་ངས་སྔོན་སེམས་ཅན་རྣམས་ལ་ཁྲག་བྱིན་པ་ནི་ཚད་མེད་དོ།
en: the blood that I have given to sentient beings as I sought supreme, completely perfect enlightenment cannot.

source: ཀུན་དགའ་བོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་མེ་ཏོག་ཅེས་བྱ་བ་གཟུགས་བཟང་བ།
en: Ānanda, formerly, in times gone by, there lived a prince named Puṣpa, good-looking,

source: ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ།
en: endowed with a supremely good complexion, excellent figure,

source: རྒྱལ་པོའི་འབྱོར་པ་ཆེན་པོ་དང་། རྒྱལ་པོའི་མཐུ་ཆེན་པོ་དང་ལྡན་པ་ཞིག་ཡོད་པ་
en: and with the great wealth and power of a king.

source: དེ་སྐྱེད་མོས་ཚལ་གྱི་སར་འགྲོ་སྟེ།
en: He was going to the site of a pleasure grove

source: གྲོང་བར་དུ་ཕྱིན་པ་དང་སྐྱ་རྦབ་ཀྱིས་ནད་ཀྱིས་བཏབ་པའི་མི་གནོད་པས་ཉེན་པ། སྡུག་བསྔལ་བ། ནད་ཚབས་ཆེན་པོ་ཞིག་མཐོང་ངོ་།
en: when he saw between the villages a man who had contracted dropsy, afflicted with suffering and seriously ill.

source: །དེས་དེ་མཐོང་ནས་ཀྱང་སྙིང་རྗེ་བར་གྱུར་ཏེ།
en: At this sight, he felt compassion and

source: །ཀྱེ་ཅི་ཞིག་གིས་མི་ཁྱོད་ཀྱི་ནད་འདི་ཞི་བར་འགྱུར།
en: My good man, what will assuage this illness of yours?

source: ཁྱོད་ལ་ཅི་ཞིག་སྦྱིན།
en: What shall I give you?

source: དེས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The man replied,

source: གལ་ཏེ་བདག་གིས་ལྷ་ཁྱོད་ཀྱི་ལུས་ལས་ཇི་ཙམ་གྱིས་ཚིམ་པར་འགྱུར་བའི་རྐང་ཞིག་ཐོབ་པ་ལྟ་ན་
en: Your Majesty, if I were to get just enough of the marrow from your body to satisfy me,

source: །དེ་ནས་རྒྱལ་བུ་གཞོན་ནུ་མེ་ཏོག་དེ་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ་རབ་ཏུ་དགའ་ནས་བདེ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: Prince Puṣpa was satisfied and delighted; he rejoiced, and then pleasure and happiness arose in him.

source: རང་གི་ལུས་བརྡུངས་ནས་རྐང་བྲུས་ཏེ་མི་དེའི་ལུས་ལ་བསྐུས་སོ།
en: He beat his own body, then gouged out the marrow and smeared it on that man’s body.

source: །ཀུན་དགའ་བོ་བསྐུས་མ་ཐག་ཏུ་མི་དེའི་ནད་སོས་པར་གྱུར་ཏོ།
en: Ānanda, as soon as he smeared it on him, the man’s illness was cured.

source: །ཀུན་དགའ་བོ་རྒྱལ་བུ་གཞོན་ནུ་མེ་ཏོག་གིས་རང་གི་ལུས་བརྡུངས་ཏེ།
en: Ānanda, even though Prince Puṣpa beat his own body so that

source: རྐང་གཟགས་ཀྱང་སེམས་ལ་འགྱོད་པ་མེད་པར་གྱུར་ཏོ།
en: the marrow dripped out, he felt no regret in his mind.

source: ། ཀུན་དགའ་བོ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་མེ་ཏོག་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་
en: Ānanda, if you wonder whether Prince Puṣpa was then, at that time, someone else,

source: ཁྱོད་དོགས་ཤིང་ཡིད་གཉིས་སམ་ཐེ་ཚོམ་ཟ་ན་དེ་ལྟར་མི་བལྟའོ།
en: or you are of two minds about it, or doubtful, do not see him so.

source: ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་མེ་ཏོག་ཅེས་བྱ་བར་གྱུར་ཏོ།
en: Because I myself was then, at that time, Prince Puṣpa.

source: །ཀུན་དགའ་བོ་རྒྱ་མཚོ་ཆེན་པོ་བཞིའི་ཆུའི་ཕུང་པོ་ནི་ཚད་བཟུང་དུ་ཡོད་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ཡོངས་སུ་ཚོལ་ཞིང་ངས་སྔོན་སེམས་ཅན་རྣམས་ལ་རྐང་བྱིན་པ་ནི་ཚད་མེད་དོ།
en: Ānanda, all the water of the four great oceans can be measured, but the marrow that I have given to sentient beings as I sought supreme, completely perfect enlightenment cannot.

source: །ཀུན་དགའ་བོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་རྒྱལ་པོ་ཟླ་འོད་ཅེས་བྱ་བ་གཟུགས་བཟང་བ།
en: Ānanda, formerly in times gone by there lived a king named Candraprabha, good-looking,

source: ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ། རྒྱལ་པོའི་འབྱོར་པ་ཆེན་པོ་དང་རྒྱལ་པོའི་མཐུ་ཆེན་པོ་དང་ལྡན་པ་ཞིག་ཡོད་པ་
en: endowed with a supremely good complexion, excellent figure, and with the great wealth and power of a king.

source: །དེ་ནས་མི་དེ་རྒྱལ་པོ་ཟླ་འོད་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: That man then approached King Candraprabha and said,

source: །ལྷ་ཁྱོད་ནི་སྐྱིད་དོ།
en: Your Majesty, you are happy.

source: །ལྷ་ཁྱོད་ནི་དགྱེས་སོ།
en: Your Majesty, you are joyful,

source: །བདག་ནི་སྡུག་བསྔལ་ལོ།
en: but I suffer.

source: །ལོང་ངོ་།
en: I am blind;

source: ། མིག་མ་མཆིས་སོ།
en: I have no eyes.

source: །དབུལ་ལོ་བཀྲེན་ནོ།
en: I am poor and destitute.

source: །སློངས་མོ་པའོ། །མགོན་མ་མཆིས་པའོ།
en: I am a beggar without refuge.

source: །ཀུན་དགའ་བོ་དེ་ནས་རྒྱལ་པོ་ཟླ་འོད་ཀྱིས་མི་དེ་ཡང་མཐོང་།
en: Then, Ānanda, King Candraprabha saw the man again,

source: ཚིག་ཀྱང་ཐོས་ནས་ངུས་ཏེ་མཆི་མ་ཟག་བཞིན་དུ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: and after listening to his words again he wept, and still in tears, asked him,

source: ཀྱེ་མི་ཁྱོད་ལ་ཅི་དགོས།
en: My good man, what do you need?

source: ཁྱོད་ལ་བཟའ་བ་དང་། བཏུང་བ་དང་། བཞོན་པ་དང་། རྒྱན་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་སྦྱིན་པར་བྱ་འམ།
en: Should I give you food or drink? A riding-mount? Jewelry? Gold, gems, pearls, or various kinds of precious things?

source: ཁྱོད་ལ་གང་དགོས་པ་དེ་སྨྲོས་ཤིག
en: Tell me whatever you need.

source: །མི་དེས་སྨྲས་པ།
en: The man replied,

source: བདག་ལ་མིག་འཚལ་ན་བདག་ལ་མིག་སྩལ་དུ་གསོལ།
en: ‘I beg you, please give me your eye.’

source: ཀུན་དགའ་བོ་དེ་ནས་རྒྱལ་པོ་ཟླ་འོད་དེས་རང་གི་མིག་ཕྱུང་སྟེ་མི་དེ་ལ་བྱིན་ནོ།
en: “So, Ānanda, King Candraprabha plucked out his eye and gave it to the man.

source: །ཀུན་དགའ་བོ་དེ་ནས་རྒྱལ་པོ་ཟླ་འོད་ཀྱིས་རང་གི་མིག་ཕྱུང་སྟེ་མི་དེ་ལ་བྱིན་ཡང་
en: But, Ānanda, although King Candraprabha had plucked out his eye and given it to the man,

source: དེའི་སེམས་ལ་འགྱོད་པ་མེད་པར་གྱུར་ཏོ།
en: he did not become regretful.

source: ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཟླ་འོད་ཅེས་བྱ་བར་གྱུར་ཏོ།
en: Because I myself was then, at that time, King Candraprabha.

source: །ཀུན་དགའ་བོ་རིའི་རྒྱལ་པོ་རི་རབ་ལ་ནི་ཚད་གཟུང་དུ་ཡོད་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ཡོངས་སུ་ཚོལ་ཞིང་ངས་སེམས་ཅན་རྣམས་ལ་མིག་བྱིན་པ་ནི་ཆེས་མང་སྟེ་ཚད་མེད་དོ།
en: Ānanda, Mount Meru, the king of mountains, can be measured, but the eyes that I have given to sentient beings as I sought supreme, completely perfect enlightenment are too great and cannot.

source: འཇུག་པ་བདེ་བ།
en: the entry is easy,

source: ལམ་བདེ་བས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་བསྒྲུབས་སོ།
en: and the path is easy, he perfectly accomplished supreme, perfect enlightenment.

source: ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་ནི་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་
en: But, Ānanda, when the bodhisattva mahāsattva Maitreya was formerly engaged in the conduct of a bodhisattva,

source: ཐབས་མཁས་པས་ཡོངས་སུ་ཟིན་པས་
en: because he fully embraced skillful means,

source: ཐེག་པ་བདེ་བ། འཇུག་པ་བདེ་བ། ལམ་བདེ་བས་
en: through the easy vehicle, the easy entry, and the easy path

source: །ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་ནི་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཐེག་པ་བདེ་བ།
en: Ānanda, when the bodhisattva mahāsattva Maitreya was formerly engaged in the conduct of a bodhisattva, because the vehicle is easy,

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་བསྒྲུབས་སོ།
en: he accomplished supreme, perfect enlightenment.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་ཐབས་ལ་མཁས་པ་གང་ལ་གནས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་བསྒྲུབས་པའི་ཐབས་ལ་མཁས་པ་དེ་གང་ལགས།
en: “Blessed One, what were the skillful means to which the bodhisattva mahāsattva Maitreya adhered, thus accomplishing supreme, perfect enlightenment?”

source: ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་ཐལ་མོ་སྦྱར་ནས་
en: he would drape his shawl over one shoulder, set his right knee on the ground, and put the palms of his hands together three times during the day and three times during the night.

source: སངས་རྒྱས་ཐམས་ཅད་མངོན་སུམ་དུ་བྱས་ཏེ་ཚིག་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Making all the buddhas visible, he would then speak to them in these words:

source: །སངས་རྒྱས་ཀུན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the buddhas!

source: །དྲང་སྲོང་ལྷ་མིག་ལྡན་པ་ཡི། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་ཡང་། །ཉན་ཐོས་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the bodhisattvas, Those sages with the divine eye— And to the śrāvakas, too.

source: །བྱང་ཆུབ་སེམས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the mind of enlightenment,

source: །ངན་འགྲོ་ཐམས་ཅད་ཟློག་བགྱིད་ཅིང་།
en: Which reverses all negative rebirths,

source: །མཐོ་རིས་ལམ་ནི་རབ་སྟོན་ལ།
en: Shows the path to higher rebirths,

source: །རྒ་ཤི་མེད་པར་འདྲེན་བགྱིད་པ།
en: And leads beings to the state without aging or death.

source: །སེམས་ཀྱི་དབང་དུ་གྱུར་པས་ན། །བདག་གིས་སྡིག་པ་ཅི་བགྱིས་པ།
en: ‘Whatever negative actions I have done Under the influence of mind,

source: སངས་རྒྱས་སྤྱན་སྔར་མཆིས་ནས་སུ། །བདག་གིས་དེ་དག་བཤགས་པར་བགྱི།
en: Here in the presence of the buddhas I confess them.

source: བདག་ལས་རྣམ་པ་གསུམ་གང་གིས། །བསོད་ནམས་ཚོགས་ནི་སྐྱེད་པ་དེ།
en: Whatever accumulation of merit I have produced through the three kinds of action,

source: །བདག་གི་ཀུན་མཁྱེན་ས་བོན་ཏེ། །བདག་གི་བྱང་ཆུབ་མི་ཟད་ཤོག
en: May it be the seed of my omniscience And inexhaustible enlightenment.

source: །ཕྱོགས་བཅུ་དག་གི་ཞིང་རྣམས་སུ། །སངས་རྒྱས་མཆོད་པ་གང་བྱུང་བ།
en: Whatever offerings to the buddhas Arise in all realms throughout the ten directions,

source: ། སངས་རྒྱས་མཁྱེན་པ་ཡི་རང་བས། །དེ་ལ་བདག་ནི་ཡི་རང་ངོ་།
en: The buddhas know and rejoice in them, And at that I myself rejoice.

source: །སྡིག་པ་ཐམས་ཅད་བཤགས་པར་བགྱི།
en: I confess all negative actions.

source: བསོད་ནམས་ཀུན་ལ་ཡི་རང་ངོ་།
en: I rejoice in all meritorious acts.

source: །བདག་ནི་ཡེ་ཤེས་མཆོག་ཐོབ་ཤོག
en: May I attain supreme awareness!

source: །ཕྱོགས་བཅུ་དག་གི་ཕྱོགས་རྣམས་ན། །ས་བཅུ་དག་ལ་གནས་པ་ཡི། །བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་མཆོག །འཚང་རྒྱ་བགྱིད་པར་སྐུལ་མ་འདེབས།
en: ‘I exhort the bodhisattvas Of all ten directions, Who abide on the ten bodhisattva levels, To attain supreme enlightenment.

source: །བྱང་ཆུབ་དམ་པར་སངས་རྒྱས་ཤིང་། །སྡེ་དང་བཅས་པའི་བདུད་བཏུལ་ནས། །སྲོག་ཆགས་ཀུན་ལ་སྨན་སླད་དུ། །ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་གྱུར་ཅིག
en: May they become truly enlightened buddhas, Overcoming negative influences of every kind, And then, to benefit living beings, May they turn the wheel of the Dharma.

source: །ཆོས་རྔ་ཆེན་པོའི་སྒྲ་ཡིས་ནི།
en: Through the sound of the great Dharma drum,

source: སྡུག་བསྔལ་སེམས་ཅན་ཐར་བགྱིད་ཤོག
en: May they bring the suffering of sentient beings to an end.

source: །བསྐལ་པ་བྱེ་བ་བསམ་ཡས་སུ།
en: For unimaginable millions of eons,

source: །ཆོས་སྟོན་མཛད་ཅིང་བཞུགས་གྱུར་ཅིག
en: May they teach the Dharma and continue to remain in this world.

source: །འདོད་པའི་འདམ་དུ་བྱིང་གྱུར་ཅིང་།
en: those who are trapped in the swamp of desire, And

source: །སྲེད་པའི་སྲད་བུས་དམ་བཅིངས་པ།
en: tightly bound by the cords of craving,

source: ། འཆིང་བ་ཀུན་གྱིས་བཅིངས་བདག་ལ།
en: Fettered in every kind of bond.

source: །རྐང་གཉིས་མཆོག་རྣམས་གཟིགས་སུ་གསོལ།
en: I beg you, best of all humans, Look upon

source: །སངས་རྒྱས་རྣམས་ནི་སྨོད་མི་མཛད།
en: Buddhas, do not belittle

source: །སེམས་ཀྱི་དྲི་མར་བགྱིས་པ་ལ།
en: Those whose minds are defiled,

source: །སེམས་ཅན་རྣམས་ལ་བྱམས་ཐུགས་ལྡན།
en: But with loving intent toward all sentient beings,

source: །སྲིད་པའི་མཚོ་ལས་སྒྲོལ་བར་ཤོག
en: Save them from the sea of existence.

source: །རྫོགས་པའི་སངས་རྒྱས་གང་བཞུགས་དང་། །གང་དག་འདས་དང་མ་བྱོན་པ། །དེ་དག་རྗེས་སུ་བདག་སློབ་ཅིང་།
en: May I train in the footsteps Of the perfect buddhas—those present now, Those of the past, and those of the future— And

source: །བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་གྱུར་ཅིག
en: may I engage in the conduct of the bodhisattvas.

source: །ཕ་རོལ་ཕྱིན་དྲུག་རྫོགས་བགྱིས་ནས། །འགྲོ་དྲུག་སེམས་ཅན་ཐར་བགྱིད་ཤོག
en: May I complete the six perfections And liberate beings of the six realms.

source: །མངོན་ཤེས་དྲུག་པོ་མངོན་བགྱིས་ནས། ། བླ་མེད་བྱང་ཆུབ་རེག་གྱུར་ཅིག
en: May I realize the six supernormal powers And reach supreme enlightenment.

source: །མ་སྐྱེས་པ་དང་མི་འབྱུང་དང་།
en: Unproduced and non-arising,

source: །རང་བཞིན་མ་མཆིས་གནས་མ་མཆིས།
en: Without self-nature or location,

source: །རྣམ་རིག་མ་མཆིས་དངོས་མ་མཆིས།
en: Neither mental cognition, nor substance—

source: །སྟོང་པའི་ཆོས་ནི་རྟོགས་པར་ཤོག
en: May I realize the teaching of emptiness.

source: །སངས་རྒྱས་དྲང་སྲོང་ཆེན་པོ་ལྟར།
en: Just like the Buddha, the great sage,

source: །སེམས་ཅན་མ་མཆིས་སྲོག་མ་མཆིས།
en: A sentient being does not exist, nor does a living being,

source: ། གང་ཟག་མ་མཆིས་གསོ་མ་མཆིས།
en: Nor does an individual, or a person.

source: །བདག་མ་མཆིས་པའི་ཆོས་རྟོགས་ཤོག
en: May I realize the teaching of non-self:

source: །བདག་འཛིན་བདག་གིར་འཛིན་པར་ནི། །དངོས་པོ་ཀུན་ལ་མི་གནས་པར།
en: May I not dwell on there being anything substantial, A belief in a self, or what I take to be mine,

source: །སེམས་ཅན་ཀུན་ལ་བདེ་སླད་དུ།
en: But in order to make all sentient beings happy,

source: །སེར་སྣ་མ་མཆིས་སྦྱིན་གཏོང་ཤོག
en: May I give everything away without miserliness.

source: །དངོས་པོ་དངོས་པོ་མ་མཆིས་པས།
en: Since material objects do not really exist,

source: །བདག་གི་ལོངས་སྤྱོད་ལྷུན་གྲུབ་ཤོག
en: May my wealth be spontaneously accomplished.

source: །དངོས་པོ་ཐམས་ཅད་རྣམ་འཇིག་པས།
en: Since all material objects decay,

source: །སྦྱིན་པའི་ཕ་རོལ་ཕྱིན་རྫོགས་ཤོག
en: May I complete the perfection of generosity.

source: །ཁྲིམས་ཀྱི་ཚུལ་ཁྲིམས་སྐྱོན་མེད་ཅིང་།
en: Possessing conduct that is flawless,

source: །ཚུལ་ཁྲིམས་རྣམ་པར་དག་དང་ལྡན།
en: Conduct that is perfect,

source: །ཚུལ་ཁྲིམས་ཕ་རོལ་ཕྱིན་རྫོགས་ཤོག
en: May I complete the perfection of moral conduct.

source: །ས་འམ་ཡང་ན་ཆུ་འམ་མེ། །རླུང་གི་ཁམས་ལྟར་མི་གནས་ཤིང་།
en: Like the elements of earth, water, fire, And wind, not dwelling on anything,

source: །བཟོད་པའམ་ཁྲོ་བ་མ་མཆིས་པར།
en: With patience and free of anger,

source: །བཟོད་པའི་ཕ་རོལ་ཕྱིན་རྫོགས་ཤོག
en: May I complete the perfection of patience.

source: བརྩོན་འགྲུས་བརྩམས་པའི་བརྩོན་འགྲུས་ཀྱིས།
en: Through assiduous application of diligence,

source: །བརྟན་སྤྲོ་ལེ་ལོ་མ་མཆིས་ཤིང་།
en: May I have constant enthusiasm without laziness,

source: །སྟོབས་དང་ལྡན་པའི་ལུས་སེམས་ཀྱིས།
en: And with strength of body and mind,

source: །བརྩོན་འགྲུས་ཕ་རོལ་ཕྱིན་རྫོགས་ཤོག
en: May I complete the perfection of diligence.

source: །སྒྱུ་མ་ལྟ་བུའི་ཏིང་འཛིན་དང་།
en: Through magic-like meditative concentration,

source: །དཔའ་བར་འགྲོ་བའི་ཏིང་འཛིན་དང་།
en: Meditative concentration of bravery, And

source: །རྡོ་རྗེ་ལྟ་བུའི་ཏིང་འཛིན་གྱིས།
en: vajra-like meditative concentration,

source: །བསམ་གཏན་ཕ་རོལ་ཕྱིན་རྫོགས་ཤོག
en: May I complete the perfection of meditation.

source: །རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། །དུས་གསུམ་མཉམ་པ་ཉིད་དང་ཡང་། །རིག་གསུམ་མངོན་སུམ་བགྱིས་པ་ཡིས།
en: Actualizing the three gates to liberation, The sameness of the three times, And the threefold knowledge,

source: །ཤེས་རབ་ཕ་རོལ་ཕྱིན་རྫོགས་ཤོག
en: May I complete the perfection of wisdom.

source: །སངས་རྒྱས་ཀུན་གྱིས་བསྔགས་པ་དང་།
en: May I be praised by all the buddhas, And

source: འོད་དང་གཟི་བརྗིད་འབར་བ་དང་།
en: blaze with light and splendor;

source: །བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱིས།
en: Through the diligence of a bodhisattva,

source: །བདག་གི་བསམ་པ་རྫོགས་གྱུར་ཅིག
en: May my intention be fulfilled.

source: །དེ་ལྟར་སྤྱད་པ་སྤྱོད་བྱེད་ཅིང་། །བྱམས་པ་གྲགས་དང་ལྡན་པ་ཡིས།
en: Thus engaging in such conduct, May I, who am known as Maitreya,

source: །ཕ་རོལ་ཕྱིན་དྲུག་རྫོགས་བྱས་ནས། །ས་བཅུ་པོ་ལ་རབ་ཏུ་གནས།
en: Complete the six perfections And dwell on the ten bodhisattva levels.

source: །ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་གང་ལ་གནས་ནས་ཐབས་ལ་མཁས་པས་ཐེག་པ་བདེ་བ། འཇུག་པ་བདེ་བ། ལམ་བདེ་བས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་བསྒྲུབས་པའི་ཐབས་ལ་མཁས་པ་ནི་དེ་ཡིན་ནོ།
en: Ānanda, those are the skillful means through which the bodhisattva mahāsattva Maitreya, by adhering to them, through the easy vehicle, the easy entry, and the easy path, perfectly accomplished supreme, perfect, and complete enlightenment.

source: ། ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་
en: Ānanda, when the bodhisattva mahāsattva Maitreya was formerly engaged in the conduct of a bodhisattva,

source: སེམས་ཅན་རྣམས་འདོད་ཆགས་ཆུང་བ་དང་།
en: sentient beings, having less desire,

source: ཞེ་སྡང་ཆུང་བ་དང་། གཏི་མུག་ཆུང་བ་དང་།
en: anger, and ignorance,

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པར་གྱུར་ལ།
en: might acquire the path of the ten virtuous actions!

source: བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ན་
en: perfectly accomplish supreme, perfect, and complete enlightenment and become a buddha.

source: ཅི་མ་རུང་ཞེས་
en: How I wish that

source: དེ་ལྟར་ཞིང་རྣམ་པར་སྦྱངས་སོ།
en: It was thus that he consecrated his buddha realm.

source: ཀུན་དགའ་བོ་དུས་དེ་དང་ཚོད་དེ་འབྱུང་བ་ཡོད་དེ། དེའི་ཚེ་དེའི་དུས་ན་
en: Ānanda, such a time and period will come about;
